Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.GetIssues Method
 Get analysis model issues.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisModelIssue> GetIssues()
Public Function GetIssues As List(Of AnalysisModelIssue)
Return Value
Type: List<AnalysisModelIssue>
The analysis model issues.
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace